#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/pisitis/terraform-aws-cloud/runs/run-t9gKMirGjJuR29Ph

Waiting for the plan to start...

Terraform v1.1.0
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
aws_dynamodb_table.terraform_locks: Refreshing state... [id=terraform-locks]
module.VPC.aws_iam_policy.policy: Refreshing state... [id=arn:aws:iam::696742900004:policy/ec2_instance_policy]
module.EFS.aws_kms_key.ACS-kms: Refreshing state... [id=4ea96d52-f4b7-418e-b205-8c74f4b6ffe5]
module.ALB.aws_acm_certificate.project_19_cert: Refreshing state... [id=arn:aws:acm:us-east-1:696742900004:certificate/fbfac241-a45f-4329-a231-c4d7b48113cf]
module.AutoScaling.aws_sns_topic.ACS-sns: Refreshing state... [id=arn:aws:sns:us-east-1:696742900004:Default_CloudWatch_Alarms_Topic]
module.VPC.aws_iam_role.ec2_instance_role: Refreshing state... [id=ec2_instance_role]
aws_s3_bucket.terraform_state: Refreshing state... [id=pbl-test-18]
module.AutoScaling.random_shuffle.az_list: Refreshing state... [id=-]
module.VPC.aws_vpc.main: Refreshing state... [id=vpc-067f062e01bcaf92b]
module.EFS.aws_kms_alias.alias: Refreshing state... [id=alias/kms]
module.EFS.aws_efs_file_system.ACS-efs: Refreshing state... [id=fs-0a306fee9251b92f9]
module.VPC.aws_iam_role_policy_attachment.test-attach: Refreshing state... [id=ec2_instance_role-20211215140153686400000002]
module.VPC.aws_iam_instance_profile.ip: Refreshing state... [id=aws_instance_profile_test]
module.EFS.aws_efs_access_point.wordpress: Refreshing state... [id=fsap-09b1687208374da9f]
module.EFS.aws_efs_access_point.tooling: Refreshing state... [id=fsap-0e2a47a913f657e36]
module.ALB.aws_route53_record.project_19_record["*.david.toolingabby.com"]: Refreshing state... [id=Z087308212S8AJ4N69UGI__ab3eba67d3eee60d99b957ae2f3ce9d2.david.toolingabby.com._CNAME]
module.ALB.aws_lb_target_group.tooling-tgt: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:696742900004:targetgroup/tooling-tgt/3d7baf526e7f447b]
module.ALB.aws_lb_target_group.wordpress-tgt: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:696742900004:targetgroup/wordpress-tgt/5710831f7df734f4]
module.VPC.aws_internet_gateway.ig: Refreshing state... [id=igw-0c6d90a087b935e8b]
module.VPC.aws_subnet.public[0]: Refreshing state... [id=subnet-0c07ca3f1fe6fca52]
module.VPC.aws_route_table.private-rtb: Refreshing state... [id=rtb-0bc97bfae56333201]
module.VPC.aws_subnet.public[1]: Refreshing state... [id=subnet-04153572dac051a66]
module.VPC.aws_subnet.private[0]: Refreshing state... [id=subnet-018f193df5e3b5f09]
module.VPC.aws_subnet.private[1]: Refreshing state... [id=subnet-026b947328931594f]
module.ALB.aws_lb_target_group.nginx-tgt: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:696742900004:targetgroup/nginx-tgt/477f9c9f013c9a8d]
module.VPC.aws_subnet.private[2]: Refreshing state... [id=subnet-0e67200375cbdf70c]
module.VPC.aws_subnet.private[3]: Refreshing state... [id=subnet-0642cc059a8bc1b23]
module.VPC.aws_route_table.public-rtb: Refreshing state... [id=rtb-00e6fac8b5d4d2574]
module.security.aws_security_group.ACS["datalayer-sg"]: Refreshing state... [id=sg-047bc68af141f849f]
module.security.aws_security_group.ACS["int-alb-sg"]: Refreshing state... [id=sg-0b23cae10cebea39f]
module.security.aws_security_group.ACS["webserver-sg"]: Refreshing state... [id=sg-0c944cf2f61646317]
module.security.aws_security_group.ACS["ext-alb-sg"]: Refreshing state... [id=sg-048a73ebbb6b4c8b2]
module.security.aws_security_group.ACS["nginx-sg"]: Refreshing state... [id=sg-07c048ccf663f0534]
module.security.aws_security_group.ACS["compute-sg"]: Refreshing state... [id=sg-0a707ea7f284b76be]
module.security.aws_security_group.ACS["bastion-sg"]: Refreshing state... [id=sg-031a81158ade47947]
module.VPC.aws_eip.nat_eip: Refreshing state... [id=eipalloc-00532f4dbe3302e3d]
module.ALB.aws_acm_certificate_validation.project_19_validation: Refreshing state... [id=2021-12-15 14:02:17.293 +0000 UTC]
module.VPC.aws_route.public-rtb-route: Refreshing state... [id=r-rtb-00e6fac8b5d4d25741080289494]
module.VPC.aws_route_table_association.public-subnets-assoc[0]: Refreshing state... [id=rtbassoc-0f3a8349227a64935]
module.VPC.aws_route_table_association.public-subnets-assoc[1]: Refreshing state... [id=rtbassoc-0a9ab8aa8a06382b3]
module.VPC.aws_nat_gateway.nat: Refreshing state... [id=nat-0a5dec7463df07e5f]
module.security.aws_security_group_rule.inbound-mysql-bastion: Refreshing state... [id=sgrule-3038766192]
module.security.aws_security_group_rule.inbound-nfs-port: Refreshing state... [id=sgrule-1095293989]
module.security.aws_security_group_rule.inbound-nginx-http: Refreshing state... [id=sgrule-1750852024]
module.AutoScaling.aws_launch_template.nginx-launch-template: Refreshing state... [id=lt-063f1e02d9caca60e]
module.security.aws_security_group_rule.inbound-alb-http: Refreshing state... [id=sgrule-623603758]
module.security.aws_security_group_rule.inbound-port-sonarqube: Refreshing state... [id=sgrule-2004772538]
module.security.aws_security_group_rule.inbound-ialb-https: Refreshing state... [id=sgrule-3705898448]
module.security.aws_security_group_rule.inbound-port-artifcatory: Refreshing state... [id=sgrule-1751177540]
module.security.aws_security_group_rule.inbound-bastion-ssh: Refreshing state... [id=sgrule-3866089542]
module.security.aws_security_group_rule.inbound-mysql-webserver: Refreshing state... [id=sgrule-3532541103]
module.security.aws_security_group_rule.inbound-web-https: Refreshing state... [id=sgrule-2688129432]
module.security.aws_security_group_rule.inbound-port-jenkins: Refreshing state... [id=sgrule-2319607111]
module.security.aws_security_group_rule.inbound-web-ssh: Refreshing state... [id=sgrule-2057823813]
module.security.aws_security_group_rule.inbound-bastion-ssh-compute: Refreshing state... [id=sgrule-2236354140]
module.security.aws_security_group_rule.inbound-alb-https: Refreshing state... [id=sgrule-4246814665]
module.security.aws_security_group_rule.inbound-ssh-bastion: Refreshing state... [id=sgrule-2579310316]
module.VPC.aws_route.private-rtb-route: Refreshing state... [id=r-rtb-0bc97bfae563332011080289494]
module.ALB.aws_lb.ext-alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:696742900004:loadbalancer/app/ACS-ext-alb/d860610293aac423]
module.VPC.aws_route_table_association.private-subnets-assoc[0]: Refreshing state... [id=rtbassoc-072aa697c73ce5ac2]
module.VPC.aws_route_table_association.private-subnets-assoc[2]: Refreshing state... [id=rtbassoc-04ed8b43703fe3f68]
module.VPC.aws_route_table_association.private-subnets-assoc[1]: Refreshing state... [id=rtbassoc-057fbd1cc53489c9b]
module.AutoScaling.aws_launch_template.wordpress-launch-template: Refreshing state... [id=lt-0159934629903b87b]
module.VPC.aws_route_table_association.private-subnets-assoc[3]: Refreshing state... [id=rtbassoc-055921f84b99fab36]
module.AutoScaling.aws_launch_template.tooling-launch-template: Refreshing state... [id=lt-091bf5e05da801ae1]
module.AutoScaling.aws_launch_template.bastion-launch-template: Refreshing state... [id=lt-0e11f6225c195b813]
module.EFS.aws_efs_mount_target.subnet-1: Refreshing state... [id=fsmt-059ebd26f1a9b14ab]
module.EFS.aws_efs_mount_target.subnet-2: Refreshing state... [id=fsmt-03f3674517bbb85bd]
module.ALB.aws_lb.ialb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:696742900004:loadbalancer/app/ialb/0a9e4959d3cab042]
module.RDS.aws_db_subnet_group.ACS-rds: Refreshing state... [id=acs-rds]
module.ALB.aws_route53_record.tooling: Refreshing state... [id=Z087308212S8AJ4N69UGI_tooling.david.toolingabby.com_A]
module.ALB.aws_route53_record.wordpress: Refreshing state... [id=Z087308212S8AJ4N69UGI_wordpress.david.toolingabby.com_A]
module.ALB.aws_lb_listener.nginx-listner: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:696742900004:listener/app/ACS-ext-alb/d860610293aac423/da49ca2445f71596]
module.ALB.aws_lb_listener.web-listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:696742900004:listener/app/ialb/0a9e4959d3cab042/07112e33f6483c15]
module.RDS.aws_db_instance.ACS-rds: Refreshing state... [id=terraform-2021121514022648810000000c]
module.ALB.aws_lb_listener_rule.tooling-listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:696742900004:listener-rule/app/ialb/0a9e4959d3cab042/07112e33f6483c15/d97c59a049768b22]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_dynamodb_table.terraform_locks has changed
  ~ resource "aws_dynamodb_table" "terraform_locks" {
        id             = "terraform-locks"
        name           = "terraform-locks"
      + tags           = {}
        # (7 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_s3_bucket.terraform_state has changed
  ~ resource "aws_s3_bucket" "terraform_state" {
        id                          = "pbl-test-18"
      + tags                        = {}
        # (10 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.ALB.aws_acm_certificate.project_19_cert has changed
  ~ resource "aws_acm_certificate" "project_19_cert" {
        id                        = "arn:aws:acm:us-east-1:696742900004:certificate/fbfac241-a45f-4329-a231-c4d7b48113cf"
      ~ status                    = "PENDING_VALIDATION" -> "ISSUED"
      + tags                      = {}
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ALB.aws_lb_listener.nginx-listner has changed
  ~ resource "aws_lb_listener" "nginx-listner" {
        id                = "arn:aws:elasticloadbalancing:us-east-1:696742900004:listener/app/ACS-ext-alb/d860610293aac423/da49ca2445f71596"
      + tags              = {}
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ALB.aws_lb_listener.web-listener has changed
  ~ resource "aws_lb_listener" "web-listener" {
        id                = "arn:aws:elasticloadbalancing:us-east-1:696742900004:listener/app/ialb/0a9e4959d3cab042/07112e33f6483c15"
      + tags              = {}
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ALB.aws_lb_listener_rule.tooling-listener has changed
  ~ resource "aws_lb_listener_rule" "tooling-listener" {
        id           = "arn:aws:elasticloadbalancing:us-east-1:696742900004:listener-rule/app/ialb/0a9e4959d3cab042/07112e33f6483c15/d97c59a049768b22"
      + tags         = {}
        # (4 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.ALB.aws_lb_target_group.nginx-tgt has changed
  ~ resource "aws_lb_target_group" "nginx-tgt" {
        id                                 = "arn:aws:elasticloadbalancing:us-east-1:696742900004:targetgroup/nginx-tgt/477f9c9f013c9a8d"
        name                               = "nginx-tgt"
      + tags                               = {}
        # (14 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.ALB.aws_lb_target_group.tooling-tgt has changed
  ~ resource "aws_lb_target_group" "tooling-tgt" {
        id                                 = "arn:aws:elasticloadbalancing:us-east-1:696742900004:targetgroup/tooling-tgt/3d7baf526e7f447b"
        name                               = "tooling-tgt"
      + tags                               = {}
        # (14 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.ALB.aws_lb_target_group.wordpress-tgt has changed
  ~ resource "aws_lb_target_group" "wordpress-tgt" {
        id                                 = "arn:aws:elasticloadbalancing:us-east-1:696742900004:targetgroup/wordpress-tgt/5710831f7df734f4"
        name                               = "wordpress-tgt"
      + tags                               = {}
        # (14 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.ALB.aws_route53_record.project_19_record["*.david.toolingabby.com"] has changed
  ~ resource "aws_route53_record" "project_19_record" {
        id              = "Z087308212S8AJ4N69UGI__ab3eba67d3eee60d99b957ae2f3ce9d2.david.toolingabby.com._CNAME"
        name            = "_ab3eba67d3eee60d99b957ae2f3ce9d2.david.toolingabby.com"
        # (6 unchanged attributes hidden)
    }

  # module.ALB.aws_route53_record.tooling has changed
  ~ resource "aws_route53_record" "tooling" {
        id      = "Z087308212S8AJ4N69UGI_tooling.david.toolingabby.com_A"
        name    = "tooling.david.toolingabby.com"
      + records = []
      + ttl     = 0
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ALB.aws_route53_record.wordpress has changed
  ~ resource "aws_route53_record" "wordpress" {
        id      = "Z087308212S8AJ4N69UGI_wordpress.david.toolingabby.com_A"
        name    = "wordpress.david.toolingabby.com"
      + records = []
      + ttl     = 0
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.AutoScaling.aws_launch_template.bastion-launch-template has changed
  ~ resource "aws_launch_template" "bastion-launch-template" {
        id                      = "lt-0e11f6225c195b813"
        name                    = "terraform-20211215140222915700000004"
      + security_group_names    = []
      + tags                    = {}
        # (10 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.AutoScaling.aws_launch_template.nginx-launch-template has changed
  ~ resource "aws_launch_template" "nginx-launch-template" {
        id                      = "lt-063f1e02d9caca60e"
        name                    = "terraform-2021121514022453040000000a"
      + security_group_names    = []
      + tags                    = {}
        # (10 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.AutoScaling.aws_launch_template.tooling-launch-template has changed
  ~ resource "aws_launch_template" "tooling-launch-template" {
        id                      = "lt-091bf5e05da801ae1"
        name                    = "terraform-20211215140223569700000008"
      + security_group_names    = []
      + tags                    = {}
        # (10 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.AutoScaling.aws_launch_template.wordpress-launch-template has changed
  ~ resource "aws_launch_template" "wordpress-launch-template" {
        id                      = "lt-0159934629903b87b"
        name                    = "terraform-20211215140223141500000006"
      + security_group_names    = []
      + tags                    = {}
        # (10 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.AutoScaling.aws_sns_topic.ACS-sns has changed
  ~ resource "aws_sns_topic" "ACS-sns" {
        id                          = "arn:aws:sns:us-east-1:696742900004:Default_CloudWatch_Alarms_Topic"
        name                        = "Default_CloudWatch_Alarms_Topic"
      + tags                        = {}
        # (6 unchanged attributes hidden)
    }

  # module.EFS.aws_efs_access_point.tooling has changed
  ~ resource "aws_efs_access_point" "tooling" {
        id              = "fsap-0e2a47a913f657e36"
      + tags            = {}
        # (5 unchanged attributes hidden)

      ~ posix_user {
          + secondary_gids = []
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.EFS.aws_efs_access_point.wordpress has changed
  ~ resource "aws_efs_access_point" "wordpress" {
        id              = "fsap-09b1687208374da9f"
      + tags            = {}
        # (5 unchanged attributes hidden)

      ~ posix_user {
          + secondary_gids = []
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.EFS.aws_efs_file_system.ACS-efs has changed
  ~ resource "aws_efs_file_system" "ACS-efs" {
        id                              = "fs-0a306fee9251b92f9"
      ~ number_of_mount_targets         = 0 -> 2
        tags                            = {
            "Name" = "ACS-file-system"
        }
        # (11 unchanged attributes hidden)
    }

  # module.EFS.aws_kms_key.ACS-kms has changed
  ~ resource "aws_kms_key" "ACS-kms" {
        id                                 = "4ea96d52-f4b7-418e-b205-8c74f4b6ffe5"
      + tags                               = {}
        # (11 unchanged attributes hidden)
    }

  # module.RDS.aws_db_instance.ACS-rds has changed
  ~ resource "aws_db_instance" "ACS-rds" {
      + enabled_cloudwatch_logs_exports       = []
        id                                    = "terraform-2021121514022648810000000c"
        name                                  = "daviddb"
      + security_group_names                  = []
      + tags                                  = {}
        # (44 unchanged attributes hidden)
    }

  # module.VPC.aws_eip.nat_eip has changed
  ~ resource "aws_eip" "nat_eip" {
      + association_id       = "eipassoc-0fd4c22627f0603ce"
        id                   = "eipalloc-00532f4dbe3302e3d"
      + network_interface    = "eni-070e158f53af9dc66"
      + private_dns          = "ip-10-0-2-127.ec2.internal"
      + private_ip           = "10.0.2.127"
        tags                 = {
            "Name" = "ACS-EIP-true"
        }
        # (8 unchanged attributes hidden)
    }

  # module.VPC.aws_iam_instance_profile.ip has changed
  ~ resource "aws_iam_instance_profile" "ip" {
        id          = "aws_instance_profile_test"
        name        = "aws_instance_profile_test"
      + tags        = {}
        # (6 unchanged attributes hidden)
    }

  # module.VPC.aws_iam_role.ec2_instance_role has changed
  ~ resource "aws_iam_role" "ec2_instance_role" {
        id                    = "ec2_instance_role"
      ~ managed_policy_arns   = [
          + "arn:aws:iam::696742900004:policy/ec2_instance_policy",
        ]
        name                  = "ec2_instance_role"
        tags                  = {
            "Environment" = "true"
            "Name"        = "aws assume role"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.VPC.aws_route_table.private-rtb has changed
  ~ resource "aws_route_table" "private-rtb" {
        id               = "rtb-0bc97bfae56333201"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = "nat-0a5dec7463df07e5f"
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "ACS-Private-Route-Table-true"
        }
        # (5 unchanged attributes hidden)
    }

  # module.VPC.aws_route_table.public-rtb has changed
  ~ resource "aws_route_table" "public-rtb" {
        id               = "rtb-00e6fac8b5d4d2574"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "igw-0c6d90a087b935e8b"
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "ACS-Public-Route-Table-true"
        }
        # (5 unchanged attributes hidden)
    }

  # module.VPC.aws_route_table_association.private-subnets-assoc[2] has changed
  ~ resource "aws_route_table_association" "private-subnets-assoc" {
        id             = "rtbassoc-04ed8b43703fe3f68"
        # (2 unchanged attributes hidden)
    }

  # module.security.aws_security_group.ACS["bastion-sg"] has changed
  ~ resource "aws_security_group" "ACS" {
        id                     = "sg-031a81158ade47947"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
        name                   = "bastion-sg"
        tags                   = {
            "Name" = "bastion-sg"
        }
        # (7 unchanged attributes hidden)
    }

  # module.security.aws_security_group.ACS["compute-sg"] has changed
  ~ resource "aws_security_group" "ACS" {
        id                     = "sg-0a707ea7f284b76be"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 8081
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8081
            },
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-031a81158ade47947",
                ]
              + self             = false
              + to_port          = 22
            },
        ]
        name                   = "compute-sg"
        tags                   = {
            "Name" = "compute-sg"
        }
        # (7 unchanged attributes hidden)
    }

  # module.security.aws_security_group.ACS["datalayer-sg"] has changed
  ~ resource "aws_security_group" "ACS" {
        id                     = "sg-047bc68af141f849f"
      ~ ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 2049
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0c944cf2f61646317",
                ]
              + self             = false
              + to_port          = 2049
            },
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-031a81158ade47947",
                  + "sg-0c944cf2f61646317",
                ]
              + self             = false
              + to_port          = 3306
            },
        ]
        name                   = "datalayer-sg"
        tags                   = {
            "Name" = "datalayer-sg"
        }
        # (7 unchanged attributes hidden)
    }

  # module.security.aws_security_group.ACS["ext-alb-sg"] has changed
  ~ resource "aws_security_group" "ACS" {
        id                     = "sg-048a73ebbb6b4c8b2"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 9000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 9000
            },
        ]
        name                   = "ext-alb-sg"
        tags                   = {
            "Name" = "ext-alb-sg"
        }
        # (7 unchanged attributes hidden)
    }

  # module.security.aws_security_group.ACS["int-alb-sg"] has changed
  ~ resource "aws_security_group" "ACS" {
        id                     = "sg-0b23cae10cebea39f"
      ~ ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-07c048ccf663f0534",
                ]
              + self             = false
              + to_port          = 443
            },
        ]
        name                   = "int-alb-sg"
        tags                   = {
            "Name" = "int-alb-sg"
        }
        # (7 unchanged attributes hidden)
    }

  # module.security.aws_security_group.ACS["nginx-sg"] has changed
  ~ resource "aws_security_group" "ACS" {
        id                     = "sg-07c048ccf663f0534"
      ~ ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-031a81158ade47947",
                ]
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-048a73ebbb6b4c8b2",
                ]
              + self             = false
              + to_port          = 443
            },
        ]
        name                   = "nginx-sg"
        tags                   = {
            "Name" = "nginx-sg"
        }
        # (7 unchanged attributes hidden)
    }

  # module.security.aws_security_group.ACS["webserver-sg"] has changed
  ~ resource "aws_security_group" "ACS" {
        id                     = "sg-0c944cf2f61646317"
      ~ ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-031a81158ade47947",
                ]
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0b23cae10cebea39f",
                ]
              + self             = false
              + to_port          = 443
            },
        ]
        name                   = "webserver-sg"
        tags                   = {
            "Name" = "webserver-sg"
        }
        # (7 unchanged attributes hidden)
    }

  # module.security.aws_security_group_rule.inbound-alb-http has changed
  ~ resource "aws_security_group_rule" "inbound-alb-http" {
        id                = "sgrule-623603758"
      + ipv6_cidr_blocks  = []
      + prefix_list_ids   = []
        # (7 unchanged attributes hidden)
    }

  # module.security.aws_security_group_rule.inbound-alb-https has changed
  ~ resource "aws_security_group_rule" "inbound-alb-https" {
        id                = "sgrule-4246814665"
      + ipv6_cidr_blocks  = []
      + prefix_list_ids   = []
        # (7 unchanged attributes hidden)
    }

  # module.security.aws_security_group_rule.inbound-bastion-ssh has changed
  ~ resource "aws_security_group_rule" "inbound-bastion-ssh" {
      + cidr_blocks              = []
        id                       = "sgrule-3866089542"
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
        # (7 unchanged attributes hidden)
    }

  # module.security.aws_security_group_rule.inbound-bastion-ssh-compute has changed
  ~ resource "aws_security_group_rule" "inbound-bastion-ssh-compute" {
      + cidr_blocks              = []
        id                       = "sgrule-2236354140"
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
        # (7 unchanged attributes hidden)
    }

  # module.security.aws_security_group_rule.inbound-ialb-https has changed
  ~ resource "aws_security_group_rule" "inbound-ialb-https" {
      + cidr_blocks              = []
        id                       = "sgrule-3705898448"
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
        # (7 unchanged attributes hidden)
    }

  # module.security.aws_security_group_rule.inbound-mysql-bastion has changed
  ~ resource "aws_security_group_rule" "inbound-mysql-bastion" {
      + cidr_blocks              = []
        id                       = "sgrule-3038766192"
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
        # (7 unchanged attributes hidden)
    }

  # module.security.aws_security_group_rule.inbound-mysql-webserver has changed
  ~ resource "aws_security_group_rule" "inbound-mysql-webserver" {
      + cidr_blocks              = []
        id                       = "sgrule-3532541103"
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
        # (7 unchanged attributes hidden)
    }

  # module.security.aws_security_group_rule.inbound-nfs-port has changed
  ~ resource "aws_security_group_rule" "inbound-nfs-port" {
      + cidr_blocks              = []
        id                       = "sgrule-1095293989"
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
        # (7 unchanged attributes hidden)
    }

  # module.security.aws_security_group_rule.inbound-nginx-http has changed
  ~ resource "aws_security_group_rule" "inbound-nginx-http" {
      + cidr_blocks              = []
        id                       = "sgrule-1750852024"
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
        # (7 unchanged attributes hidden)
    }

  # module.security.aws_security_group_rule.inbound-port-artifcatory has changed
  ~ resource "aws_security_group_rule" "inbound-port-artifcatory" {
        id                = "sgrule-1751177540"
      + ipv6_cidr_blocks  = []
      + prefix_list_ids   = []
        # (7 unchanged attributes hidden)
    }

  # module.security.aws_security_group_rule.inbound-port-jenkins has changed
  ~ resource "aws_security_group_rule" "inbound-port-jenkins" {
        id                = "sgrule-2319607111"
      + ipv6_cidr_blocks  = []
      + prefix_list_ids   = []
        # (7 unchanged attributes hidden)
    }

  # module.security.aws_security_group_rule.inbound-port-sonarqube has changed
  ~ resource "aws_security_group_rule" "inbound-port-sonarqube" {
        id                = "sgrule-2004772538"
      + ipv6_cidr_blocks  = []
      + prefix_list_ids   = []
        # (7 unchanged attributes hidden)
    }

  # module.security.aws_security_group_rule.inbound-ssh-bastion has changed
  ~ resource "aws_security_group_rule" "inbound-ssh-bastion" {
        id                = "sgrule-2579310316"
      + ipv6_cidr_blocks  = []
      + prefix_list_ids   = []
        # (7 unchanged attributes hidden)
    }

  # module.security.aws_security_group_rule.inbound-web-https has changed
  ~ resource "aws_security_group_rule" "inbound-web-https" {
      + cidr_blocks              = []
        id                       = "sgrule-2688129432"
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
        # (7 unchanged attributes hidden)
    }

  # module.security.aws_security_group_rule.inbound-web-ssh has changed
  ~ resource "aws_security_group_rule" "inbound-web-ssh" {
      + cidr_blocks              = []
        id                       = "sgrule-2057823813"
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
        # (7 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.AutoScaling.aws_autoscaling_attachment.asg_attachment_nginx will be created
  + resource "aws_autoscaling_attachment" "asg_attachment_nginx" {
      + alb_target_group_arn   = "arn:aws:elasticloadbalancing:us-east-1:696742900004:targetgroup/nginx-tgt/477f9c9f013c9a8d"
      + autoscaling_group_name = (known after apply)
      + id                     = (known after apply)
    }

  # module.AutoScaling.aws_autoscaling_attachment.asg_attachment_tooling will be created
  + resource "aws_autoscaling_attachment" "asg_attachment_tooling" {
      + alb_target_group_arn   = "arn:aws:elasticloadbalancing:us-east-1:696742900004:targetgroup/tooling-tgt/3d7baf526e7f447b"
      + autoscaling_group_name = (known after apply)
      + id                     = (known after apply)
    }

  # module.AutoScaling.aws_autoscaling_attachment.asg_attachment_wordpress will be created
  + resource "aws_autoscaling_attachment" "asg_attachment_wordpress" {
      + alb_target_group_arn   = "arn:aws:elasticloadbalancing:us-east-1:696742900004:targetgroup/wordpress-tgt/5710831f7df734f4"
      + autoscaling_group_name = (known after apply)
      + id                     = (known after apply)
    }

  # module.AutoScaling.aws_autoscaling_group.bastion-asg will be created
  + resource "aws_autoscaling_group" "bastion-asg" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = 1
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = "ELB"
      + id                        = (known after apply)
      + max_size                  = 1
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = "bastion-asg"
      + name_prefix               = (known after apply)
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + vpc_zone_identifier       = [
          + "subnet-04153572dac051a66",
          + "subnet-0c07ca3f1fe6fca52",
        ]
      + wait_for_capacity_timeout = "10m"

      + launch_template {
          + id      = "lt-0e11f6225c195b813"
          + name    = (known after apply)
          + version = "$Latest"
        }

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "ACS-bastion"
        }
    }

  # module.AutoScaling.aws_autoscaling_group.nginx-asg will be created
  + resource "aws_autoscaling_group" "nginx-asg" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = 1
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = "ELB"
      + id                        = (known after apply)
      + max_size                  = 2
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = "nginx-asg"
      + name_prefix               = (known after apply)
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + vpc_zone_identifier       = [
          + "subnet-04153572dac051a66",
          + "subnet-0c07ca3f1fe6fca52",
        ]
      + wait_for_capacity_timeout = "10m"

      + launch_template {
          + id      = "lt-063f1e02d9caca60e"
          + name    = (known after apply)
          + version = "$Latest"
        }

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "ACS-nginx"
        }
    }

  # module.AutoScaling.aws_autoscaling_group.tooling-asg will be created
  + resource "aws_autoscaling_group" "tooling-asg" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = 1
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = "ELB"
      + id                        = (known after apply)
      + max_size                  = 1
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = "tooling-asg"
      + name_prefix               = (known after apply)
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + vpc_zone_identifier       = [
          + "subnet-018f193df5e3b5f09",
          + "subnet-026b947328931594f",
        ]
      + wait_for_capacity_timeout = "10m"

      + launch_template {
          + id      = "lt-091bf5e05da801ae1"
          + name    = (known after apply)
          + version = "$Latest"
        }

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "ACS-tooling"
        }
    }

  # module.AutoScaling.aws_autoscaling_group.wordpress-asg will be created
  + resource "aws_autoscaling_group" "wordpress-asg" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = 1
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = "ELB"
      + id                        = (known after apply)
      + max_size                  = 1
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = "wordpress-asg"
      + name_prefix               = (known after apply)
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + vpc_zone_identifier       = [
          + "subnet-018f193df5e3b5f09",
          + "subnet-026b947328931594f",
        ]
      + wait_for_capacity_timeout = "10m"

      + launch_template {
          + id      = "lt-0159934629903b87b"
          + name    = (known after apply)
          + version = "$Latest"
        }

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "ACS-wordpress"
        }
    }

  # module.AutoScaling.aws_autoscaling_notification.david_notifications will be created
  + resource "aws_autoscaling_notification" "david_notifications" {
      + group_names   = [
          + "bastion-asg",
          + "nginx-asg",
          + "tooling-asg",
          + "wordpress-asg",
        ]
      + id            = (known after apply)
      + notifications = [
          + "autoscaling:EC2_INSTANCE_LAUNCH",
          + "autoscaling:EC2_INSTANCE_LAUNCH_ERROR",
          + "autoscaling:EC2_INSTANCE_TERMINATE",
          + "autoscaling:EC2_INSTANCE_TERMINATE_ERROR",
        ]
      + topic_arn     = "arn:aws:sns:us-east-1:696742900004:Default_CloudWatch_Alarms_Topic"
    }

  # module.AutoScaling.aws_launch_template.bastion-launch-template will be updated in-place
  ~ resource "aws_launch_template" "bastion-launch-template" {
        id                      = "lt-0e11f6225c195b813"
      ~ image_id                = "ami-0463972c5b1966d78" -> "ami-0b0af3577fe5e3532"
        name                    = "terraform-20211215140222915700000004"
        tags                    = {}
        # (10 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.AutoScaling.aws_launch_template.nginx-launch-template will be updated in-place
  ~ resource "aws_launch_template" "nginx-launch-template" {
        id                      = "lt-063f1e02d9caca60e"
      ~ image_id                = "ami-013cd16037f68ad76" -> "ami-0b0af3577fe5e3532"
        name                    = "terraform-2021121514022453040000000a"
        tags                    = {}
        # (10 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.AutoScaling.aws_launch_template.tooling-launch-template will be updated in-place
  ~ resource "aws_launch_template" "tooling-launch-template" {
        id                      = "lt-091bf5e05da801ae1"
      ~ image_id                = "ami-0cfa8c14613ca075a" -> "ami-0b0af3577fe5e3532"
        name                    = "terraform-20211215140223569700000008"
        tags                    = {}
        # (10 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.AutoScaling.aws_launch_template.wordpress-launch-template will be updated in-place
  ~ resource "aws_launch_template" "wordpress-launch-template" {
        id                      = "lt-0159934629903b87b"
      ~ image_id                = "ami-0cfa8c14613ca075a" -> "ami-0b0af3577fe5e3532"
        name                    = "terraform-20211215140223141500000006"
        tags                    = {}
        # (10 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.VPC.aws_route.private-rtb-route will be updated in-place
  ~ resource "aws_route" "private-rtb-route" {
      + gateway_id             = "nat-0a5dec7463df07e5f"
        id                     = "r-rtb-0bc97bfae563332011080289494"
      - nat_gateway_id         = "nat-0a5dec7463df07e5f" -> null
        # (4 unchanged attributes hidden)
    }

  # module.VPC.aws_route_table_association.private-subnets-assoc[2] is tainted, so must be replaced
-/+ resource "aws_route_table_association" "private-subnets-assoc" {
      ~ id             = "rtbassoc-04ed8b43703fe3f68" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.compute.aws_instance.Jenkins will be created
  + resource "aws_instance" "Jenkins" {
      + ami                                  = "ami-0b0af3577fe5e3532"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "devops"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-0c07ca3f1fe6fca52"
      + tags                                 = {
          + "Name" = "ACS-Jenkins"
        }
      + tags_all                             = {
          + "Name" = "ACS-Jenkins"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = [
          + "sg-0a707ea7f284b76be",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # module.compute.aws_instance.artifactory will be created
  + resource "aws_instance" "artifactory" {
      + ami                                  = "ami-0b0af3577fe5e3532"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.medium"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "devops"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-0c07ca3f1fe6fca52"
      + tags                                 = {
          + "Name" = "ACS-artifactory"
        }
      + tags_all                             = {
          + "Name" = "ACS-artifactory"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = [
          + "sg-0a707ea7f284b76be",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # module.compute.aws_instance.sonbarqube will be created
  + resource "aws_instance" "sonbarqube" {
      + ami                                  = "ami-0b0af3577fe5e3532"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.medium"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "devops"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-0c07ca3f1fe6fca52"
      + tags                                 = {
          + "Name" = "ACS-sonarqube"
        }
      + tags_all                             = {
          + "Name" = "ACS-sonarqube"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = [
          + "sg-0a707ea7f284b76be",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

Plan: 12 to add, 5 to change, 1 to destroy.


```
</details>
*Pusher: @Livingstone95, Action: `pull_request`*